//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//    				1.Функции вкладки Main
//	Атрибуты: 1. Main.tim=100
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//===============================================================
//	1.1.Периодическое мерцание(анимация) индикатора живучести Nextion
//===============================================================
    cntBlink++
if( cntBlink>=4)     //--Счетчик для периода 400ms=Main.tim*4
{
    cntBlink=0
 if(numBlink==0)
 {
       blink.pic=2
 }
if(numBlink==1)
  {
      blink.pic=3
  }
  if(numBlink==2)
  {
     blink.pic=2
  }
  if(numBlink==3)
  {
     blink.pic=3
  }
     numBlink++
  if(numBlink>3)
  {
     numBlink=0
  }
}
//==============================================================
//  Вывод номера страницы по изменению или периодически (1сек)
//==============================================================
sys0=0
if(vPage!=dp)
{
  sys0=1
  cntPage=0
  vPage=dp
}
if(cntPage==0)
{
  sys0=1
}
cntPage++
if(cntPage>=30)
{
  cntPage=0
}
if(sys0>0)
{
  sendme
}
//==============================================================
