//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//							 	1.Контроллер Arduino UNO
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_AVR_UNO) 		 					  
    #define  RT_HW_BOARD_CODE     1   									//--Идентификатор выбора платы c кодом платы;
    #define  RT_HW_BOARD_NAME     "Arduino UNO(ATmega328)"							//--Наименование платы;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_MEMORY	  "FLASH=32kB,RAM=2Kb,EEPROM=1Kb"		//--Параметры памяти;
    #define  RT_HW_BOARD_FCPU     16 									//--Частота процессора;	
    #define  RT_HW_BOARD_VCC      5000									//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_AVR_UNO  										//--Идентификатор типа платы;
    #define  RT_HW_CORE_AVR												//--Идентификатор программной среды;
	#define  RT_HW_BLOCK_ETH											//--Идентификатор запрета раоты с Ethernet;
#endif

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//							 	2.Контроллер Arduino Nano
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_AVR_NANO) 		 					  
    #define  RT_HW_BOARD_CODE     2   									//--Идентификатор выбора платы c кодом платы;
    #define  RT_HW_BOARD_NAME     "Arduino Nano(ATmega328)"				//--Наименование платы;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_MEMORY	  "FLASH=32kB,RAM=2Kb,EEPROM=1Kb"		//--Параметры памяти;
    #define  RT_HW_BOARD_FCPU     16 									//--Частота процессора;	
    #define  RT_HW_BOARD_VCC      5000									//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_AVR_NANO  										//--Идентификатор типа платы;
    #define  RT_HW_CORE_AVR												//--Идентификатор программной среды;
	#define  RT_HW_BLOCK_ETH											//--Идентификатор запрета раоты с Ethernet;
#endif					

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//							 	3.Контроллер Arduino Mini
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_AVR_MINI) 		 					  
    #define  RT_HW_BOARD_CODE     3   									//--Идентификатор выбора платы c кодом платы;
    #define  RT_HW_BOARD_NAME     "Arduino Mini(ATmega328)"				//--Наименование платы;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_MEMORY	  "FLASH=32kB,RAM=2Kb,EEPROM=1Kb"		//--Параметры памяти;
    #define  RT_HW_BOARD_FCPU     16 									//--Частота процессора;	
    #define  RT_HW_BOARD_VCC      5000									//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_AVR_NANO  										//--Идентификатор типа платы;
    #define  RT_HW_CORE_AVR												//--Идентификатор программной среды;
	#define  RT_HW_BLOCK_ETH											//--Идентификатор запрета раоты с Ethernet;
#endif	

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//							 	4.Контроллер Arduino Pro
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_AVR_PRO) 		 					  
    #define  RT_HW_BOARD_CODE     4   									//--Идентификатор выбора платы c кодом платы;
    #define  RT_HW_BOARD_NAME     "Arduino PRO(ATmega168)"				//--Наименование платы;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_MEMORY	  "FLASH=16kB,RAM=512B"					//--Параметры памяти;
    #define  RT_HW_BOARD_FCPU     16 									//--Частота процессора;	
    #define  RT_HW_BOARD_VCC      5000									//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_AVR_NANO  										//--Идентификатор типа платы;
    #define  RT_HW_CORE_AVR												//--Идентификатор программной среды;
	#define  RT_HW_BLOCK_ETH											//--Идентификатор запрета работы с Ethernet;
#endif

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//							 	5.Контроллер Arduino MEGA2560
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_AVR_MEGA2560)
    #define  RT_HW_BOARD_CODE     5 									//--Идентификатор выбора платы;
    #define  RT_HW_BOARD_NAME  	  "Arduino Mega 2560"     				//--Наименование платы;
//--------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_MEMORY	"FLASH=256Kb,RAM=8Kb,EEPROM=4Kb;"		//--Параметры памяти;
    #define  RT_HW_BOARD_FCPU     16 									//--Частота процессора;	
    #define  RT_HW_BOARD_VCC      5000									//--Значение Vсс процессора;
//-----Корректировка для PROGMEM для RAM>64kB;----------------------------------------------------
#if defined(RT_HW_BOARD_AVR_MEGA2560)	
  //#ifdef  PROGMEM											
  //#undef  PROGMEM													
  //#endif													
  //#define PROGMEM __attribute__(( section(".progmem.data") ))
#endif
//-------------------------------------------------------------------------------------------------
#endif

//=================================================================================================
//								9.Arduino AVR ANON
//=================================================================================================
#if !defined(RT_HW_BOARD_CODE) && defined(__AVR__)								
    #define  RT_HW_BOARD_CODE     9 									//--Идентификатор выбора платы;
    #define  RT_HW_BOARD_NAME    "AVR ANON[near of kin Arduno Uno]" 	//--Наименование платы;	
//--------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_MEMORY	"FLASH=32Kb,RAM=2Kb,EEPROM=1Kb"			//--Параметры памяти;
    #define  RT_HW_BOARD_FCPU    16 									//--Частота процессора;	
    #define  RT_HW_BOARD_VCC      5000									//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_AVR_ANON										//--Идентификатор типа платы;
    #define  RT_HW_CORE_AVR												//--Идентификатор программной среды;
//--------------------------------------------------------------------------------------------------
#endif
//=================================================================================================