//=================================================================================================
//                       1.СИСТЕМНЫЕ ПЕРЕМЕННЫЕ РЕДАКТОРА Nextion
// sys0,sys1,sys2 - переменные для использования пользователем;
// dp     - код текущей страницы;
// dim     - уровень подсветки (0-100);
// thc     - цвет кисти для рисования. Допустимые значения BALACK,BLUE,BROWN,GREEN,YELLOW,RED,GRAY,WHITE, числовое значение RGB565;
// bkcmd- управление возвращаемыми данными (0,1,2,3);
// sleep- переход в режим сна(=1);
// wup     - страница после выхода из режима сна;
// ussp     - интервал в секундах по истечении которого, при отсутствии данных из UART, произойдет переход в режим сна (0-отключено,3-65535сек);
// thsp     - интервал в секундах по истечении которого, при отсутствии касания экрана  произойдет переход в режим сна (0-отключено,3-65535сек);
// thup     - выход из режима сна при отсутствии касания: =0-не выходить из сна при касании; =1-выход из сна при касании;
// thc2,tch3 - последнии координаты (x,y) точки касания (только на чтение);
//-------Параметры для дисплев с расширенными возможностями(K,P)-----------------------------------
// rtc0,rtc1,rtc2,rtc3,rtc4,rtc5,rtc6-год,месяц,число,час,минута,секунда,день недели часов реального времени;
//=================================================================================================
int sys0=0,sys1=0,sys2=0          //--Пользовательские значения;
//=================================================================================================
//                       2.ОБЩИЕ ПОЛЬЗОВАТЕЛЬСКИЕ ПЕРЕМЕННЫЕ
//=================================================================================================
int vPage,cntPage                   //--Номер предыдущей страницы,счетчик для отсчета периода периодических транзакций;
int agoSec,changeTime               //--Буфер для контроля изменения времени (по rtc5(секунды) или rtc4(мин);
int vReadySystem                    //--Флаг готовности для отправки системных значений из Nextion в MCU;
int userSys0,userSys1               //--Зарезервированные пользовательские переменные;
int vBlink,cntBlink,numBlink        //--Переменные для мерцания(анимации) выбранным изображением на каждой страницы;
int buf,buf1,buf2,buf3              //--Рабочие буфера;
int idx,idx1,idx2,idx3              //--Рабочие индексы;
//=================================================================================================
//                       3.ПОЛЬЗОВАТЕЛЬСКИЕ ПЕРЕМЕННЫЕ
//   для формирования транзакций из Nextion в контроллер (протокол - клон ModBus)
//=================================================================================================
int head,func,adr,qntReg,qntByte,crc //--Заголовок посылки,функция(6,16,56),адрес(0xFFFF),кол-во регистров(0xFF),кол-во байт(0xFF),CRC(0xFF);
int cmdPack,cntPack    //--Команда управления отправки транзакции, счетчик для отсчета периода периодических транзакций;
//=================================================================================================
//                       4.ВХОДНЫЕ ПОЛЬЗОВАТЕЛЬСКИЕ ПЕРЕМЕННЫЕ
//      (для записи параметров из MCU в Nextion командами inx=123456789 или inx=0xFFFFFFFF)
// ПРИМЕЧАНИЕ: кол-во параметров и их имена могут быть измененены пользователем под конкретный проект.
//=================================================================================================
int in0,   in1,   in2,   in3,   in4,   in5,   in6,   in7,   in8,   in9
int in10,  in11,  in12,  in13,  in14,  in15,  in16,  in17,  in18,  in19
int in20,  in21,  in22,  in23,  in24,  in25,  in26,  in27,  in28,  in29
int in30,  in31,  in32,  in33,  in34,  in35,  in36,  in37,  in38,  in39
int in40,  in41,  in42,  in43,  in44,  in45,  in46,  in47,  in48,  in49
int in50,  in51,  in52,  in53,  in54,  in55,  in56,  in57,  in58,  in59
//=================================================================================================
//             5.ПОЛЬЗОВАТЕЛЬСКИЕ ПАРАМЕТРЫ ДЛЯ РАБОТЫ СО СТРАНИЦАМИ
//ПРИМЕЧАНИЕ: кол-во параметров и их имена могут быть измененены пользователем под конкретный проект.
//=================================================================================================
int out0,  out1,  out02, out3,  out4,  out5,  out6,  out7,  out8,  out9
int out10, out11, out12, out13, out14, out15, out16, out17, out18, out19
int out20, out21, out22, out23, out24, out25, out26, out27, out28, out29
int out30, out31, out32, out33, out34, out35, out36, out37, out38, out39
int out40, out41, out42, out43, out44, out45, out46, out47, out48, out49
int out50, out51, out52, out53, out54, out55, out56, out57, out58, out59

int ago0,  ago1,  ago2,  ago3,  ago4,  ago5,  ago6,  ago7,  ago8,  ago9
int ago10, ago11, ago12, ago13, ago14, ago15, ago16, ago17, ago18, ago19
int ago20, ago21, ago22, ago23, ago24, ago25, ago26, ago27, ago28, ago29
int ago30, ago31, ago32, ago33, ago34, ago35, ago36, ago37, ago38, ago39
int ago40, ago41, ago42, ago43, ago44, ago45, ago46, ago47, ago48, ago49
int ago50, ago51, ago52, ago53, ago54, ago55, ago56, ago57, ago58, ago59
//=================================================================================================
//                 10.ИНСТРУКЦИИ ДЛЯ РАБОТЫ С ГРАФИКАМИ
// 1.Управление байтами через переменную grB(xxB):
//    grB=0xYYZZ, ZZ-данные, YY-команда(=70-заполнение массива, =71-сдвиг массива);
//    Примеры: №1 grB=0x703F; №2 grB=0x7177;
// 2. Управление 4-байтными переменными=grL через переменную grR              
//       grR(=70-заполнение массива, =71-сдвиг массива, =90-заполнение треугольником);
//    Примеры: №1 grL=0x703F; grR=0x70
//             №2 grL=0x716D; grR=0x71
//             №3 grR=0x90;
//=================================================================================================
int idGrafic,chanelGrafic           //--id и канал(0-3) графика;
int cmdByte,cmdLong                 //--Рабочие команды для работы с графиками;
int dataByte,dataLong,dataRun       //--Рабочие параметры для работы с графиками;
int cmndGrafic,limGrafic,valGrafic  //--Рабочие параметры для построения графиков;
//=============================================================================
//                10.1.ИСХОДНЫЕ ДАННЫЕ ДЛЯ ИНДИВИДУАЛЬНОГО ГРАФИКА gr
//=============================================================================
int  grSize=512   //--Количество точек в графике. Рекомендуется выбирать кратным 64 (128,192,256,320,384,448,512 и т.д.);
int  grB=0,grL=0,grR=0,grEnd //--Параметры управления(grB,grL,grR), вспомогательный параметр GrEnd
int  gr0,gr1,gr2,gr3,gr4,gr5,gr6,gr7,gr8,gr9,gr10,gr11,gr12,gr13,gr14,gr15
//=============================================================================

//=================================================================================================
//                       20.ОБЩИЙ КОД ПРОГРАММЫ
//Примечание: во избежании редких случаев настройки скорости рекомендуется
//            в секции прединициализации page 0 установить параметр bauds=11500
//=================================================================================================
dim=100                                   //--Установка яркости;
thc=BLUE                                  //--Цвет кисти для рисования;
bkcmd=2                                   //--Отправлять данные только когда последняя команда НЕ была выполнена;
//-------------------------------------------------------------------------------------------------
wup=255                                   //--После выхода из сна будет загружена последняя страница;  wup=0 -- после пробуждения будет загружена страница с ID=0
ussp=0                                    //--Переход в режим сна при отсутствии данных из UART отключен;
thsp=0                                    //--Переход в режим сна при отсутствии касания экрана отключен;
thup=1                                    //--Выход из сна при касании;
//-------------------------------------------------------------------------------------------------
baud=115200                              //--Установка скорости обмена;
page 0                                   //--Установка начальной страницы;
//=================================================================================================