//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//							  Контроллеры программной среды STM32F4x7
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//								1.DevEBox STM32F407VET6 [Black F407VE]
//=================================================================================================
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_BLACK_F407VE) 
#define      RT_HW_BOARD_CODE  	  131                                     	//--Идентификатор выбора платы c кодом платы;
#define      RT_HW_BOARD_NAME  	  "Black F407VE(DevEBox STM32F407VET6)"		//--Наименование платы;
#define      RT_HW_BOARD_MEMORY   "Flash=512Kb; SRAM=System(112+16+64)+Backup(4)Kb;" //--Параметры памяти; 
#define      RT_HW_BOARD_FCPU     160 										//--Частота процессора;	
#define      RT_HW_BOARD_VCC      3300										//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_DEVEBOX_STM32F407Vxx 								//--Идентификатор типа платы;
#define      RT_HW_CORE_STM32												//--Идентификатор программной среды
#define      RT_HW_CORE_STM32F4V											//--Идентификатор программной среды
#endif
//=================================================================================================
//								2.DevEBox STM32F407VGT6 [Black F407VG]
//=================================================================================================
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_BLACK_F407VG)     			
#define      RT_HW_BOARD_CODE  	  132                                     	//--Идентификатор выбора платы c кодом платы;
#define      RT_HW_BOARD_NAME  	  "Black F407VE(DevEBox STM32F407VGT6)"		//--Наименование платы;
#define      RT_HW_BOARD_MEMORY   "Flash=1024; SRAM=System(112+16+64)+Backup(4)Kb;" //--Параметры памяти; 
#define      RT_HW_BOARD_FCPU     160 										//--Частота процессора;	
#define      RT_HW_BOARD_VCC      3300										//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_DEVEBOX_STM32F407Vxx	 							//--Идентификатор типа платы;
#define      RT_HW_CORE_STM32												//--Идентификатор программной среды
#define      RT_HW_CORE_STM32F4V											//--Идентификатор программной среды
#endif
//=================================================================================================
//								3.STM32F4xx F4VE [FK407M1_STM32F407VET]
//=================================================================================================
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_FK407M1_STM32F407VET)			
#define      RT_HW_BOARD_CODE     133                                    	//--Идентификатор выбора платы c кодом платы;
#define      RT_HW_BOARD_NAME     "STM32_FK407M1_STM32F407VET(STM32_F4VE)"	//--Наименование платы;
#define      RT_HW_BOARD_MEMORY   "Flash=512; SRAM=System(112+16+64)+Backup(4)Kb;" //--Параметры памяти; 
#define      RT_HW_BOARD_FCPU     160 										//--Частота процессора;	
#define      RT_HW_BOARD_VCC      3300										//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_STM32F4XX_F4VE										//--Идентификатор типа платы;
#define      RT_HW_CORE_STM32												//--Идентификатор программной среды
#define      RT_HW_CORE_STM32F4V											//--Идентификатор программной среды
#endif
//=================================================================================================
