//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//						ПРИВЯЗКА ПАРАМЕТРОВ СЕНСОРОВ К ВХОДНЫМ ПЕРЕМЕННЫМ
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
AHTxt=in100
AHTxh=in101
SHT3xt=in101
SHT3xh=in103
BMP180t=in104
BMP180p=in105
BMP280t=in106
BMP280p=in107
BME280t=in108
BME280h=in109
BME280p=in110
CMTHPt=in111
CMTHPh=in112
CMTHPp=in113
DHT22t=in114
DHT22h=in115
BH1750lx=in116
DS1820t=in117
SR04Len=in118
MAX6675t=in119
//==================================================================================================
//               0.Формирование AHTx для txtAHTx.txt
//==================================================================================================
vTXT.txt="AHTx T="
sys2=colorOFF
sys0=devOk			//--ok=devOk.0;
sys0&=1				
if(sys0==1)
{
sys2=colorON
}
//-------------------------------------
sys0=AHTxt
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
vTXT.txt+=" H="
sys0=AHTxh
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
//-------------------------------------
txtAHTx.txt=vTXT.txt				//--Присвоение полю значения;
txtAHTx.bco=sys2					//--Установка фона поля;
//==================================================================================================
//               1.Формирование SHT3x для txtSHT3x.txt
//==================================================================================================
vTXT.txt="SHT3x T="
sys2=colorOFF
sys0=devOk>>1					//--ok=devOk.1;
sys0&=1				
if(sys0==1)
{
sys2=colorON
}
//-------------------------------------
sys0=SHT3xt
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
vTXT.txt+=" H="
sys0=SHT3xh
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
//-------------------------------------
txtSHT3x.txt=vTXT.txt			//--Присвоение полю значения;
txtSHT3x.bco=sys2				//--Установка фона поля;

//==================================================================================================
//               2.Формирование BMP180 для txtBMP180.txt
//==================================================================================================
vTXT.txt="BMP180 T="
sys2=colorOFF
sys0=devOk>>2					//--ok=devOk.2;
sys0&=1				
if(sys0==1)
{
sys2=colorON
}
//-------------------------------------
sys0=BMP180t
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
vTXT.txt+=" P="
sys0=BMP180p
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
//-------------------------------------
//txtBMP180.txt=vTXT.txt		//--Присвоение полю значения;
//txtBMP180.bco=sys2			//--Установка фона поля;

//==================================================================================================
//               3.Формирование BMP280 для txtBMP280.txt
//==================================================================================================
vTXT.txt="BMP280 T="
sys2=colorOFF
sys0=devOk>>2					//--ok=devOk.2;
sys0&=1				
if(sys0==1)
{
sys2=colorON
}
//-------------------------------------
sys0=BMP280t
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
vTXT.txt+=" P="
sys0=BMP280p
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
//-------------------------------------
//txtBMP280.txt=vTXT.txt		//--Присвоение полю значения;
//txtBMP280.bco=sys2			//--Установка фона поля;
//==================================================================================================
//               4.Формирование BME280 для txtBME280.txt
//==================================================================================================
vTXT.txt="BME280 T="
sys2=colorOFF
sys0=devOk>>4					//--ok=devOk.2;
sys0&=1				
if(sys0==1)
{
sys2=colorON
}
//-------------------------------------
sys0=BME280t
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
vTXT.txt+=" H="
sys0=BME280h
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
vTXT.txt+=" P="
sys0=BME280p
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
//-------------------------------------
//txtBME280.txt=vTXT.txt		//--Присвоение полю значения;
//txtBME280.bco=sys2			//--Установка фона поля;
//==================================================================================================
//               5.Формирование BME280 для txtCMTHP.txt
//==================================================================================================
vTXT.txt="CMTHP T="
sys2=colorOFF
sys0=devOk>>5					//--ok=devOk.2;
sys0&=1				
if(sys0==1)
{
sys2=colorON
}
//-------------------------------------
sys0=CMTHPt
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
vTXT.txt+=" H="
sys0=CMTHPh
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
vTXT.txt+=" P="
sys0=CMTHPp
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
//-------------------------------------
txtCMTHP.txt=vTXT.txt			//--Присвоение полю значения;
txtCMTHP.bco=sys2				//--Установка фона поля;


//==================================================================================================
//               6.Формирование DHT22 для txtDHT22.txt
//==================================================================================================
vTXT.txt="DHT22 T="
sys2=colorOFF
sys0=devOk>>6					//--ok=devOk.0;
sys0&=1				
if(sys0==1)
{
sys2=colorON
}
//-------------------------------------
sys0=DHT22t
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
vTXT.txt+=" H="
sys0=DHT22h
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
//-------------------------------------
//txtDHT22.txt=vTXT.txt			//--Присвоение полю значения;
//txtDHT22.bco=sys2				//--Установка фона поля;

//==================================================================================================
//               7.Формирование BH1750 для txtBH1750.txt
//==================================================================================================
vTXT.txt="BH1750 Lux="
sys2=colorOFF
sys0=devOk>>7			//--ok=devOk.0;
sys0&=1				
if(sys0==1)
{
sys2=colorON
}
//-------------------------------------
sys0=BH1750lx
covx sys0,vSTR.txt,0,0   		
vTXT.txt+=vSTR.txt
//-------------------------------------
txtBH1750.txt=vTXT.txt		//--Присвоение полю значения;
txtBH1750.bco=sys2			//--Установка фона поля;
//==================================================================================================
//               8.Формирование DS1820 для txtDS1820.txt
//==================================================================================================
vTXT.txt="DS1820 T="
sys2=colorOFF
sys0=devOk>>8					//--ok=devOk.0;
sys0&=1				
if(sys0==1)
{
sys2=colorON
}
//-------------------------------------
sys0=DS1820t
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
//-------------------------------------
txtDS1820.txt=vTXT.txt			//--Присвоение полю значения;
txtDS1820.bco=sys2				//--Установка фона поля;
//==================================================================================================
//               9.Формирование HC-SR04 для txtSR04.txt
//==================================================================================================
vTXT.txt="SR04 Len="
sys2=colorOFF
sys0=devOk>>9					//--ok=devOk.0;
sys0&=1				
if(sys0==1)
{
sys2=colorON
}
//-------------------------------------
sys0=SR04Len
covx sys0,vSTR.txt,0,0   		
vTXT.txt+=vSTR.txt
//-------------------------------------
txtSR04.txt=vTXT.txt			//--Присвоение полю значения;
txtSR04.bco=sys2				//--Установка фона поля;
//==================================================================================================
//               10.Формирование MAX6675 для txtMAX6675.txt
//==================================================================================================
vTXT.txt="MAX6675 T="
sys2=colorOFF
sys0=devOk>>9					//--ok=devOk.0;
sys0&=1				
if(sys0==1)
{
sys2=colorON
}
//-------------------------------------
sys0=MAX6675t
covx sys0,vSTR.txt,0,1   		
vTXT.txt+=vSTR.txt
//-------------------------------------
txtMAX6675.txt=vTXT.txt		//--Присвоение полю значения;
txtMAX6675.bco=sys2			//--Установка фона поля;
//==================================================================================================
