//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//						ПРИВЯЗКА ПАРАМЕТРОВ СЕНСОРОВ К ВХОДНЫМ ПЕРЕМЕННЫМ
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
ADS1115f0=in50
ADS1115f1=in51
ADS1115f2=in52
ADS1115f3=in53
ADS1256f0=in60
ADS1256f1=in61
ADS1256f2=in62
ADS1256f3=in63
ADS1256f4=in64
ADS1256f5=in65
ADS1256f6=in66
ADS1256f7=in67
//--------------------------------------------------------------------------------------------------

//==================================================================================================
//               1.Формирование AHTx для txtAHTx.txt
//==================================================================================================
vTXT.txt="ADS1115[0-3]: "
sys2=colorOFF
sys0=devOk>>30			//--ok=devOk.0;
sys0&=1				
if(sys0==1)
{
sys2=colorON
}
//-------------------------------------
sys0=ADS1115f0
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt+"  "
//-------------------------------------
sys0=ADS1115f1
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt+"  "
//-------------------------------------
sys0=ADS1115f2
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt+"  "
//-------------------------------------
sys0=ADS1115f3
covx sys0,vSTR.txt,0,1   		//--Преобразование в float-формат
vTXT.txt+=vSTR.txt
//-------------------------------------
txtADS1115.txt=vTXT.txt				//--Присвоение полю значения;
txtADS1115.bco=sys2					//--Установка фона поля;
//==================================================================================================

//==================================================================================================
//               2.Формирование DIN для txtDIN.txt
//==================================================================================================
vTXT.txt="DIN: "
sys2=colorON
//-------------------------------------
sys0=mDIN
covx sys0,vSTR.txt,0,2   		//--Преобразование в HEX-формат
vTXT.txt+=vSTR.txt
//-------------------------------------
txtDIN.txt=vTXT.txt				//--Присвоение полю значения;
txtDIN.bco=sys2					//--Установка фона поля;

//==================================================================================================
//               3.Формирование DOT для txtDOT.txt
//==================================================================================================
vTXT.txt="DOT: "
sys2=colorON
//-------------------------------------
sys0=mDOT
covx sys0,vSTR.txt,0,2   		//--Преобразование в HEX-формат
vTXT.txt+=vSTR.txt
//-------------------------------------
txtDOT.txt=vTXT.txt				//--Присвоение полю значения;
txtDOT.bco=sys2					//--Установка фона поля;
//==================================================================================================