//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//						Системные параметры панели
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//==================================================================================================
//             	1.Отправка времени в MCU
//==================================================================================================
head=0x3A      	//--Заголовок
func=0x56      	//--Отправка нескольких регистров байтовых регистров
adr=1        	//--Адрес первого отправляемого регистра
qntReg=7        //--Кол-во отправляемых регистров
qntByte=7    	//--Кол-во отправляемых байт
//--------------------------------------------------------------------------------------------------
//				1.2.Расчет контрольной суммы
//--------------------------------------------------------------------------------------------------
crc=head
crc+=func
crc+=adr
crc+=qntReg
crc+=qntByte
crc+=nYear		//
crc+=nMonth
crc+=nDay
crc+=nHour
crc+=nMin
crc+=nSec
crc+=nWeek
crc=crc&0xFF
crc=0xFF-crc
crc+=1
crc&=0xFF
//--------------------------------------------------------------------------------------------------
//				1.3.Вывод в UART
//--------------------------------------------------------------------------------------------------
prints head,1
prints func,1
prints adr,1
prints qntReg,1
prints qntByte,1
prints vYear,1
prints vMonth,1
prints vDay,1
prints vHour,1
prints vMin,1
prints vSec,1
prints vWeek,1
prints crc,1
printh FF FF FF
//=================================================================
