//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//						04.MCU Системные параметры с платы MCU период=1000
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//==================================================================================================
//               1.Формирование строки txtSP0.txt - CORE0
//==================================================================================================
vTXT.txt="CORE0="					//--Быстродействие CORE0;
covx mSP0,vSTR.txt,0,0						
vTXT.txt+=vSTR.txt
//-------------------------------------
txtSP0.txt=vTXT.txt					//--Присвоение полю значения;
//==================================================================================================
//               2.Формирование строки txtSP1.txt - CORE0
//==================================================================================================
vTXT.txt="CORE1="					//--Быстродействие CORE0;
covx mSP1,vSTR.txt,0,0						
vTXT.txt+=vSTR.txt
//-------------------------------------
txtSP1.txt=vTXT.txt					//--Присвоение полю значения;

//==================================================================================================
//               3.Формирование строки txtSp0.txt - CORE0/1000
//==================================================================================================
vTXT.txt="Core0="					//--Быстродействие CORE0/1000;
sys0=mSP0/1000;
covx sys0,vSTR.txt,0,0						
vTXT.txt+=vSTR.txt
//-------------------------------------
txtSp0.txt=vTXT.txt					//--Присвоение полю значения;

//==================================================================================================
//               4.Формирование строки txtSp1.txt - CORE1/1000
//==================================================================================================
vTXT.txt="Core1="					//--Быстродействие CORE1/1000;
sys0=mSP1/1000;
covx sys0,vSTR.txt,0,0						
vTXT.txt+=vSTR.txt
//-------------------------------------
txtSp1.txt=vTXT.txt					//--Присвоение полю значения;

//==================================================================================================
//               5.Формирование строки txtMotor.txt - Мотосекунды
//==================================================================================================
vTXT.txt="Sec:"						//--Время работы контроллера в сек;
covx mMotor,vSTR.txt,0,0
vTXT.txt+=vSTR.txt
//-------------------------------------
txtMotor.txt=vTXT.txt				//--Присвоение полю значения;
//==================================================================================================
//               6.Формирование  строки txtBoard.txt -ID платы
//==================================================================================================
vTXT.txt="ID:"						//--ID контроллера;
covx mID,vSTR.txt,0,2
vTXT.txt+=vSTR.txt
//-------------------------------------
txtBoard.txt=vTXT.txt				//--Присвоение полю значения;
//==================================================================================================
//               7.Формирование строки txtIP.txt - IP Ethernet
//==================================================================================================
sys0=mIP
vTXT.txt="IP:"
//-------------------------------------
sys1=sys0>>24 
sys1=sys1&0xFF
covx sys1,vSTR.txt,0,0
vTXT.txt+=vSTR.txt+"."
//-------------------------------------
sys1=sys0>>16 
sys1=sys1&0xFF
covx sys1,vSTR.txt,0,0
vTXT.txt+=vSTR.txt+"."
//-------------------------------------
sys1=sys0>>8
sys1=sys1&0xFF
covx sys1,vSTR.txt,0,0
vTXT.txt+=vSTR.txt+"."
//-------------------------------------
sys1=sys0
sys1=sys1&0xFF
covx sys1,vSTR.txt,0,0
vTXT.txt+=vSTR.txt
//-------------------------------------
txtIP.txt=vTXT.txt				//--Присвоение полю значения;
//==================================================================================================
//             	8.Формирование строки txtMAC.txt
//==================================================================================================
sys0=mMAC1
vTXT.txt="MAC:"
//-------------------------------------
sys1=sys0>>16
sys1=sys1&0xFF
covx sys1,vSTR.txt,0,2   		//--Преобразование в HEX-формат
vTXT.txt+=vSTR.txt+":"		
//-------------------------------------
sys1=sys0>>8
sys1=sys1&0xFF
covx sys1,vSTR.txt,0,2   		//--Преобразование в HEX-формат
vTXT.txt+=vSTR.txt+":"		
//-------------------------------------
sys1=sys0
sys1=sys1&0xFF
covx sys1,vSTR.txt,0,2   		//--Преобразование в HEX-формат
vTXT.txt+=vSTR.txt+":"		
//-------------------------------------
sys0=mMAC2
//-------------------------------------
sys1=sys0>>16
sys1=sys1&0xFF
covx sys1,vSTR.txt,0,2   		//--Преобразование в HEX-формат
vTXT.txt+=vSTR.txt+":"		
//-------------------------------------
sys1=sys0>>8
sys1=sys1&0xFF
covx sys1,vSTR.txt,0,2   		//--Преобразование в HEX-формат
vTXT.txt+=vSTR.txt+":"		
//-------------------------------------
sys1=sys0
sys1=sys1&0xFF
covx sys1,vSTR.txt,0,2   		//--Преобразование в HEX-формат
vTXT.txt+=vSTR.txt		
//-------------------------------------
txtMAC.txt=vTXT.txt				//--Присвоение полю значения
//==================================================================================================
