//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//                                     4. РАСШИРИТЕЛИ
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//                                     4.1. 74HC595PLC.SPI Ввывод бегущей '1'
//=================================================================================================

//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_TEST_PERMIT_PLC_RP_55)
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
RT_HW_PIN_DIR_ID         idDotPLC[4];      uint8_t pinPLC[4]={2,3,22,29};
RT_HW_74HC595_DEV        dv595PLC;        RT_HW_STRUCT_SHED_TASK sh595PLC; 
//------------------------------------------------------------------------------------------------
RT_HW_GENERATOR_EVENT_ID idGenPLC;         RT_HW_COUNTER_ID       idCntPLC;   uint16_t vCntPLC=0;    uint16_t vGenPLC=0;   
RT_HW_GENERATOR_RUN_ID   idRunPLC;  
//================================================================================================
void expDotPLC(){   
//------------------------------------------------------------------------------------------------
if(idCntPLC.reset){RT_HW_Base.counterReset(idCntPLC,12,0,1,0);}      //--Инициализация счетчика: top=8, bottom=0, шаг изменения=1, начальное значение=0;
if(RT_HW_Base.generatorEvent(idGenPLC,200)) {
vCntPLC=RT_HW_Base.counterT(idCntPLC);  vGenPLC=RT_HW_Base.dc16(vCntPLC);}; //--Пилa, бегущая "1", 32 разряда;
//------------------------------------------------------------------------------------------------
  RT_HW_Base.pinDigitalWrite(idDotPLC[0],pinPLC[0],  vGenPLC    &1); //--Вывод цикла бита 0;
  RT_HW_Base.pinDigitalWrite(idDotPLC[1],pinPLC[1],((vGenPLC>>1)&1));//--Вывод цикла бита 1;
  RT_HW_Base.pinDigitalWrite(idDotPLC[2],pinPLC[2],((vGenPLC>>2)&1));//--Вывод цикла бита 2;
  RT_HW_Base.pinDigitalWrite(idDotPLC[3],pinPLC[3],((vGenPLC>>3)&1));//--Вывод цикла бита 3;  
//------------------------------------------------------------------------------------------------
if(dv595PLC.custom==0){dv595PLC.custom=RT_HW_Base.spiSetParam(dv595PLC.dvS,cs595PLC,0,4000000);
                       dv595PLC.mi='S'; dv595PLC.qnt=1;       //--Кол-во регистров 74HC595(1-4);
                       dv595PLC.bitOrder=0;                  //--Последовательность вывода: =1 - впереди старший бит;
                       RT_HW_Base.setTaskID(sh595PLC, 'Q',5); //--Вывод по изменениям с проверкой каждые 5 циклов программы; 
}
//-------------------------------------------------------------------------------------------------
RT_HW_Base.directTask(sh595PLC);
RT_HW_74hc595.direct(dv595PLC,(vGenPLC>>4),sh595PLC.run);};
#else
void expDotPLC(){;};
#endif
