#include "RT_HW_NEXT.h"
//=================================================================================================
//						Constructor												
//=================================================================================================
RT_HW_NEXT:: RT_HW_NEXT(){
//--------------------------------------------------------------------------------------------------
for(int8_t i=0; i<=RT_HW_NEXT_MAX_DEVICE;i++){								//--Заполнение указателей ссылкой на непустое устройство;
 ptr[i]=&zN; 																//--Запись указателя;
 ptr[i]->custom=0; ptr[i]->num=0;  ptr[i]->ready=0;  ptr[i]->uart=255;		//--Запись параметров;
 ptr[i]->lenArrByte=sizeof(hive.arrByte)/1; ptr[i]->ptrArrByte=hive.arrByte;//--Начальная запись параметров массива v8;
 ptr[i]->lenArrWord=sizeof(hive.arrWord)/2; ptr[i]->ptrArrWord=hive.arrWord;//--Начальная запись параметров массива v16;   
 ptr[i]->lenArrLong=sizeof(hive.arrLong)/4; ptr[i]->ptrArrLong=hive.arrLong;//--Начальная запись параметров массива v32;
} 


hive.set=0x00; hive.qnt=0;
//--------------------------------------------------------------------------------------------------
//for(int8_t i=0; i<=RT_HW_NEXT_MAX_GRAFIC;i++){							//--Заполнение указателей ссылкой на непустое устройство;
// ptrGrafic[i]=&gN; 														//--Запись указателя;
//} 
//hive.set=0x00; hive.qnt=0;
//--------------------------------------------------------------------------------------------------
};
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++	
RT_HW_NEXT RT_HW_Next;	//Создание внешнего объекта	
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
