//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//							 1.Контроллер (D) BluePill F103C8
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_BLUEPILL_F103C6) 		 					  
#define      RT_HW_BOARD_CODE     60    									//--Идентификатор выбора платы c кодом платы;
#define      RT_HW_BOARD_NAME     "BluePill F103C6"							//--Наименование платы;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_MEMORY	  "FLASH=32Kb,RAM=20Kb"						//--Параметры памяти;
#define      RT_HW_BOARD_FCPU     72 										//--Частота процессора;	
#define      RT_HW_BOARD_VCC      3300										//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_STM32F103CXX  										//--Идентификатор типа платы;
#define      RT_HW_CORE_STM32												//--Идентификатор программной среды
#define      RT_HW_CORE_STM32F1C											//--Идентификатор программной среды
#endif
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//							 2.Контроллер (D) BluePill F103C8
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_BLUEPILL_F103C8) 		 					  
#define      RT_HW_BOARD_CODE     61    									//--Идентификатор выбора платы c кодом платы;
#define      RT_HW_BOARD_NAME     "BluePill F103C8"							//--Наименование платы;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_MEMORY	  "FLASH=64Kb,RAM=20Kb"						//--Параметры памяти;
#define      RT_HW_BOARD_FCPU     72 										//--Частота процессора;	
#define      RT_HW_BOARD_VCC      3300										//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_STM32F103CXX  										//--Идентификатор типа платы;
#define      RT_HW_CORE_STM32												//--Идентификатор программной среды
#define      RT_HW_CORE_STM32F1C												//--Идентификатор программной среды
#endif
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//							 3.Контроллер (D) BluePill F103CB (or C8 with 128k)
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_BLUEPILL_F103CB) 		 					  
#define      RT_HW_BOARD_CODE     62    									//--Идентификатор выбора платы c кодом платы;
#define      RT_HW_BOARD_NAME     "BluePill F103CB"						//--Наименование платы;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_MEMORY	  "FLASH=128,RAM=20Kb"						//--Параметры памяти;
#define      RT_HW_BOARD_FCPU     72 										//--Частота процессора;	
#define      RT_HW_BOARD_VCC      5000										//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_STM32F103CXX  										//--Идентификатор типа платы;
#define      RT_HW_CORE_STM32												//--Идентификатор программной среды
#define      RT_HW_CORE_STM32F1C												//--Идентификатор программной среды
#endif
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//							 4.Контроллер (D) BlackPill F103C8
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_BLACKPILL_F103C8) 		 					  
#define      RT_HW_BOARD_CODE     63    									//--Идентификатор выбора платы c кодом платы;
#define      RT_HW_BOARD_NAME     "BlackPill F103C8"						//--Наименование платы;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_MEMORY	  "FLASH=64Kb,RAM=20Kb"						//--Параметры памяти;
#define      RT_HW_BOARD_FCPU     72 										//--Частота процессора;	
#define      RT_HW_BOARD_VCC      3300										//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_STM32F103CXX	  									//--Идентификатор типа платы;
#define      RT_HW_CORE_STM32												//--Идентификатор программной среды
#define      RT_HW_CORE_STM32F1C												//--Идентификатор программной среды
#endif
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//							 5.Контроллер (D) BlackPill F103CB (or C8 with 128k)
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_BLACKPILL_F103CB) 		 					  
#define      RT_HW_BOARD_CODE     64    									//--Идентификатор выбора платы c кодом платы;
#define      RT_HW_BOARD_NAME     "BllackPill F103CB"				    	//--Наименование платы;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_MEMORY	  "FLASH=128,RAM=20Kb"						//--Параметры памяти;
#define      RT_HW_BOARD_FCPU     72 										//--Частота процессора;	
#define      RT_HW_BOARD_VCC      3300										//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_STM32F103CXX									//--Идентификатор типа платы;
#define      RT_HW_CORE_STM32												//--Идентификатор программной среды
#define      RT_HW_CORE_STM32F1C												//--Идентификатор программной среды
#endif
//=================================================================================================
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//							 6.Контроллер GENERIC F103RETX
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_GENERIC_F103RETX)	 					  
#define      RT_HW_BOARD_CODE     65    									//--Идентификатор выбора платы c кодом платы;
#define      RT_HW_BOARD_NAME     "Generic F103RETx"						//--Наименование платы;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_MEMORY	  "FLASH=512,RAM=128Kb"						//--Параметры памяти;
#define      RT_HW_BOARD_FCPU     72 										//--Частота процессора;	
#define      RT_HW_BOARD_VCC      3300										//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_GENERIC_F103RXX 									//--Идентификатор типа платы [variant.STM32F1(xxx/F103R(C-D-E)Y)];
#define      RT_HW_CORE_STM32												//--Идентификатор программной среды
#define      RT_HW_CORE_STM32F1R											//--Идентификатор программной среды
#endif
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//							 7.Контроллер GENERIC F103RETX
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_GENERIC_F103R)	 					  
#define      RT_HW_BOARD_CODE     66    									//--Идентификатор выбора платы c кодом платы;
#define      RT_HW_BOARD_NAME     "Generic F103R"							//--Наименование платы;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_MEMORY	  "FLASH=512,RAM=128Kb"						//--Параметры памяти;
#define      RT_HW_BOARD_FCPU     72 										//--Частота процессора;	
#define      RT_HW_BOARD_VCC      3300										//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_D_GENERIC_F103RXX 									//--Идентификатор типа платы [variant.STM32F1(xxx/F103R(C-D-E)Y)];
#define      RT_HW_CORE_STM32												//--Идентификатор программной среды
#define      RT_HW_CORE_STM32F1R											//--Идентификатор программной среды
#endif
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//							 8.Контроллер GENERIC F103VETX
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_GENERIC_F103VETX)	 					  
#define      RT_HW_BOARD_CODE     67   										//--Идентификатор выбора платы c кодом платы;
#define      RT_HW_BOARD_NAME     "Generic F103VETx"						//--Наименование платы;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_MEMORY	  "FLASH=512,RAM=128Kb"						//--Параметры памяти;
#define      RT_HW_BOARD_FCPU     72 										//--Частота процессора;	
#define      RT_HW_BOARD_VCC      3300										//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
#define      RT_HW_BOARD_GENERIC_F103VXX									//--Идентификатор типа платы [variant.STM32F1(xxx/F103R(C-D-E)Y)];
#define      RT_HW_CORE_STM32												//--Идентификатор программной среды
#define      RT_HW_CORE_STM32F1V											//--Идентификатор программной среды
#endif
//=================================================================================================
